tap "homebrew/bundle"
brew "bat"                   # cat clone
brew "fish"
brew "fisher"                # plugin manager for fish
brew "git"
brew "git-delta"             # better diff tool for git
brew "gnupg"
brew "lazygit"
brew "lynx"                  # required for html viewing in mutt
brew "mise"                  # required for programming language management
brew "mutt"
brew "neovim"
brew "pinentry-mac"
brew "ripgrep"
brew "taskwarrior"           # cli based todo list manager
brew "timewarrior"           # cli based time tracking
cask "docker"
cask "font-fira-code"        # required for ~/.config/kitty/kitty.conf
cask "font-hack-nerd-font"   # required for ~/.config/kitty/kitty.conf
cask "kitty"
cask "little-snitch"
cask "rapidapi"
cask "raycast"
